In [16]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [17]:
df_user = pd.read_csv('user_data.csv')
df_user.head()

           city        education  age
0  Brooklyn, NY          college   31
1  Brooklyn, NY  graduate degree   31
2  Brooklyn, NY  graduate degree   32
3  Brooklyn, NY          college   37
4  Brooklyn, NY          college   21

In [18]:
df_pop = pd.read_csv('pop2_data.csv')
df_pop.head()

                 city  population_proper
0   Prairie Ridge, WA                NaN
1          Edison, WA                NaN
2        Packwood, WA                NaN
3  Wautauga Beach, WA                NaN
4          Harper, WA                NaN

In [19]:
# df_user.info()
# len(df_user)

In [20]:
# df_pop.info()
# len(df_pop)

In [21]:
df = pd.merge(df_user,df_pop)

In [22]:
# df.loc[df.population_proper < 100000, "location"] = "rural"
# df.loc[df.population_proper >= 100000, "location"] = "urban"

df['location'] = df['population_proper'].apply(
    lambda x: 'urban' if x >= 100000 else 'rural'
)

In [39]:
df.head(10)

             city        education  age  population_proper location
0    Brooklyn, NY          college   31          2629150.0    urban
1    Brooklyn, NY  graduate degree   31          2629150.0    urban
2    Brooklyn, NY  graduate degree   32          2629150.0    urban
3    Brooklyn, NY          college   37          2629150.0    urban
4    Brooklyn, NY          college   21          2629150.0    urban
5      Austin, TX          college   25           947890.0    urban
6      Austin, TX  graduate degree   22           947890.0    urban
7     Oakland, CA  graduate degree   29           420005.0    urban
8  Pittsburgh, PA          college   29           303625.0    urban
9  Pittsburgh, PA          college   27           303625.0    urban

In [43]:
# df.groupby(['age','education']).education.count().sort_values(ascending=False)

In [42]:
df.groupby('city').age.count().sort_values(ascending=False).head(5)

city
Boston, MA          14
Philadelphia, PA    13
Los Angeles, CA      9
Baltimore, MD        9
New York, NY         8
Name: age, dtype: int64

In [70]:
df.groupby(['city','education']).education.count().sort_values(ascending=False)

city               education
Philadelphia, PA   graduate degree    11
Boston, MA         college             8
Chicago, IL        graduate degree     7
Boston, MA         graduate degree     6
Los Angeles, CA    graduate degree     6
                                      ..
Nashville, TN      graduate degree     1
New York, NY       high school         1
Oakland, CA        graduate degree     1
Oklahoma City, OK  college             1
Albany, NY         graduate degree     1
Name: education, Length: 100, dtype: int64

In [71]:
dfg = df.groupby(['city','education'])\
.education\
.count()\
.sort_values(ascending=False)\
.sort_index(level=['city','education'],ascending=[True,True])

In [73]:
dfg.filter(like='Boston',axis=0)

city        education
Boston, MA  college            8
            graduate degree    6
Name: education, dtype: int64

In [63]:
df['location'].value_counts()

urban    174
rural      8
Name: location, dtype: int64

In [64]:
df['age'].value_counts()

31    18
34    13
21    11
22    11
37    11
32    11
29    11
28    11
24    10
33    10
36     9
35     9
27     9
23     8
26     8
25     8
30     7
38     5
44     1
45     1
Name: age, dtype: int64

In [ ]:
df.head()